🚀&nbsp; env0 had composed a PR Plan for environment [Asaf / env0-playground simple-tf (env_0_playground_simple_tf)](https://app.env0.com/p/8cc99f17-388c-47f8-b558-eeba46d667df/environments/ef24544e-8cab-4ba0-bc86-be218afd0f44):
```
Plan: 1 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:


  # random_string.random will be created
+   resource "random_string" "random" {
+       id          = (known after apply)
+       keepers     = {
+           "refresh_date" = "00/00/0000"
        }
+       length      = 5
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       result      = (known after apply)
+       special     = true
+       upper       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_string = (known after apply)
```
</details>


```
Failed to calculate cost estimation
```

To *apply* this plan, use the following comment:
```
env0 apply -e env_0_playground_simple_tf
```


[Full PR Plan logs on env0](https://app.env0.com/p/8cc99f17-388c-47f8-b558-eeba46d667df/environments/ef24544e-8cab-4ba0-bc86-be218afd0f44/deployments/0f9202c1-0a7d-4b22-92ea-ce6809c21a90)